U2 = [0.57 0.44 0.35 0.27 0.20 0.16 0.14 0.12 0.11 0.10 0.06 0.03 0.028 0.022 0.017 0.015 0.012 0.011 0.01];
U2_R = [0.74  0.74 0.70 0.70 0.69 0.68 0.66 0.64 0.6 0.56 0.43 0.3 0.22 0.17 0.14 0.12 0.10 0.09 0.08];
F = [0.1:0.1:0.9 1:1:10];
U2_smooth = smooth(F, U2, 0.1, 'loess');
f = linspace(0.0001,10, 1000);
H = 0.11*100*1/2/pi./f/10^3./sqrt((0.151*0.294-0.11^2)^2 + (0.151*100./f/10^3/2/pi).^2);
H_R = 0.11*1000*1./f/2/pi/10^3./sqrt((0.151*0.294-0.11^2)^2 + (0.151*1000./f/2/pi/10^3).^2);
figure;

plot(F, U2, 'b.', F, U2_smooth); grid on; hold on;
plot(f, H, 'black--');
legend("", "Опыт", "Расчет")
xlabel("f, кГц")
ylabel("|H(j\omega)|");

figure;
plot(F, U2_R, 'b.', F, smooth(F, U2_R, 5, "loess"), f, H_R, "black--"); grid on;
xlabel("f, кГц")
ylabel("|H(j\omega)|");
legend("", "Опыт", "Расчет");
